In [1]:
import numpy as np
import pandas as pd

In [2]:
#series Syntax: pd.Series(data,index,dtype)
series=pd.Series(data=[78,92,36,64,89])
series

0    78
1    92
2    36
3    64
4    89
dtype: int64

In [3]:
#Series.Values provides values
series.values

array([78, 92, 36, 64, 89], dtype=int64)

In [4]:
#Series.index provides indexs
series.index

RangeIndex(start=0, stop=5, step=1)

### Accessing data in series:

In [5]:
series[1]

92

In [6]:
series[1:3]

1    92
2    36
dtype: int64

#### creating a pandas series

In [7]:
data=pd.Series(data=[70000,80000,1600000,1800000,30000000],index=['swift','jazz','civic','altis','gallardo'])
data

swift          70000
jazz           80000
civic        1600000
altis        1800000
gallardo    30000000
dtype: int64

In [8]:
#values can be accessed as
data['swift']

70000

In [9]:
data['jazz':'gallardo']

jazz           80000
civic        1600000
altis        1800000
gallardo    30000000
dtype: int64

#### using dictionary to create a series

In [10]:
car_price_dict={'swift':7000000,'jazz':8000000,'civic':1600000,'altis':1800000,'gallardo':3000000}
car_price=pd.Series(car_price_dict)
car_price

swift       7000000
jazz        8000000
civic       1600000
altis       1800000
gallardo    3000000
dtype: int64

In [11]:
car_price_dict={'swift':7000000,'jazz':8000000,'civic':1600000,'altis':1800000,'gallardo':3000000}
car_price=pd.Series(car_price_dict)

car_man_dict={'swift':'maruti','jazz':'honda','civic':'honda','altis':'toyota','gallardo':'lamborghini'}
car_man=pd.Series(car_man_dict)
print(car_price)
print(car_man)

swift       7000000
jazz        8000000
civic       1600000
altis       1800000
gallardo    3000000
dtype: int64
swift            maruti
jazz              honda
civic             honda
altis            toyota
gallardo    lamborghini
dtype: object

### Creating a DataFrame object

#### syntax: pd.DataFrame(data,index,columns)

In [12]:
cars=pd.DataFrame({'price':car_price,'manufacturer':car_man})
cars

            price manufacturer
swift     7000000       maruti
jazz      8000000        honda
civic     1600000        honda
altis     1800000       toyota
gallardo  3000000  lamborghini

In [13]:
cars['price']

swift       7000000
jazz        8000000
civic       1600000
altis       1800000
gallardo    3000000
Name: price, dtype: int64

In [14]:
cars['manufacturer']

swift            maruti
jazz              honda
civic             honda
altis            toyota
gallardo    lamborghini
Name: manufacturer, dtype: object

### 1.From a single series object

In [15]:
car_price_dict={'swift':7000000,'jazz':8000000,'civic':1600000,'altis':1800000,'gallardo':3000000}
car_price=pd.Series(car_price_dict)
car_price
pd.DataFrame(car_price,columns=['Car price'])

          Car price
swift       7000000
jazz        8000000
civic       1600000
altis       1800000
gallardo    3000000

### 2.From a list of dictionaries

In [16]:
data=[{'name':'subodh','marks':28},{'name':'ram','marks':27},{'name':'john','marks':28}]
pd.DataFrame(data)

     name  marks
0  subodh     28
1     ram     27
2    john     28

In [17]:
pd.DataFrame([{'subodh':20,'ram':25},{'abdul':29,'john':24}],index=['mathematics','physics'])

             subodh   ram  abdul  john
mathematics    20.0  25.0    NaN   NaN
physics         NaN   NaN   29.0  24.0

### 3.From a dictionary of series objects

In [18]:
car_price_dict={'swift':7000000,'jazz':8000000,'civic':1600000,'altis':1800000,'gallardo':3000000}
car_price=pd.Series(car_price_dict)

car_man_dict={'swift':'maruti','jazz':'honda','civic':'honda','altis':'toyota','gallardo':'lamborghini'}
car_man=pd.Series(car_man_dict)
cars=pd.DataFrame({'price':car_price,'manufacturer':car_man})
cars

            price manufacturer
swift     7000000       maruti
jazz      8000000        honda
civic     1600000        honda
altis     1800000       toyota
gallardo  3000000  lamborghini

### 4.From an existing file

In [19]:
data_csv=pd.read_csv("housing.csv")
data_csv

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished
...,...,...,...,...,...,...,...,...,...,...,...,...,...
540,1820000,3000,2,1,1,yes,no,yes,no,no,2,no,unfurnished
541,1767150,2400,3,1,1,no,no,no,no,no,0,no,semi-furnished
542,1750000,3620,2,1,1,yes,no,no,no,no,0,no,unfurnished
543,1750000,2910,3,1,1,no,no,no,no,no,0,no,furnished
544,1750000,3850,3,1,2,yes,no,no,no,no,0,no,unfurnished

In [20]:
data_csv.head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished

In [21]:
data_csv.tail()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
540,1820000,3000,2,1,1,yes,no,yes,no,no,2,no,unfurnished
541,1767150,2400,3,1,1,no,no,no,no,no,0,no,semi-furnished
542,1750000,3620,2,1,1,yes,no,no,no,no,0,no,unfurnished
543,1750000,2910,3,1,1,no,no,no,no,no,0,no,furnished
544,1750000,3850,3,1,2,yes,no,no,no,no,0,no,unfurnished

In [22]:
data_csv.describe()

,price,area,bedrooms,bathrooms,stories,parking
count,5.450000e+02,545.000000,545.000000,545.000000,545.000000,545.000000
mean,4.766729e+06,5150.541284,2.965138,1.286239,1.805505,0.693578
std,1.870440e+06,2170.141023,0.738064,0.502470,0.867492,0.861586
min,1.750000e+06,1650.000000,1.000000,1.000000,1.000000,0.000000
25%,3.430000e+06,3600.000000,2.000000,1.000000,1.000000,0.000000
50%,4.340000e+06,4600.000000,3.000000,1.000000,2.000000,0.000000
75%,5.740000e+06,6360.000000,3.000000,2.000000,2.000000,1.000000
max,1.330000e+07,16200.000000,6.000000,4.000000,4.000000,3.000000

In [23]:
data_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 545 entries, 0 to 544
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   price             545 non-null    int64
 1   area              545 non-null    int64
 2   bedrooms          545 non-null    int64
 3   bathrooms         545 non-null    int64
 4   stories           545 non-null    int64
 5   mainroad          545 non-null    object
 6   guestroom         545 non-null    object
 7   basement          545 non-null    object
 8   hotwaterheating   545 non-null    object
 9   airconditioning   545 non-null    object
 10  parking           545 non-null    int64
 11  prefarea          545 non-null    object
 12  furnishingstatus  545 non-null    object
dtypes: int64(6), object(7)
memory usage: 55.5+ KB

### setting custom index:

In [24]:
#creating a subset using head
data_head=data_csv.head()
#Setting name as custom index
data_head.set_index('area',inplace=True)
data_head

,price,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
area,,,,,,,,,,,,
7420,13300000,4,2,3,yes,no,no,no,yes,2,yes,furnished
8960,12250000,4,4,4,yes,no,no,no,yes,3,no,furnished
9960,12250000,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
7500,12215000,4,2,2,yes,no,yes,no,yes,3,yes,furnished
7420,11410000,4,1,2,yes,yes,yes,no,yes,2,no,furnished

#### iloc Syntax: dt.iloc[Rows,columns]

In [25]:
data_csv.iloc[2,1]

9960

In [26]:
data_csv.iloc[2,-1]

'semi-furnished'

In [27]:
data_csv.iloc[1:5,4:6]

   stories mainroad
1        4      yes
2        2      yes
3        2      yes
4        2      yes

In [42]:
marks={'chemistry':[67,90,87,56],'physics':[69,32,45,43],'mathematics':[57,59,33,90],'english':[23,43,56,76]}
marks_df=pd.DataFrame(marks,index=['subodh','ram','abdul','john'])
marks_df

        chemistry  physics  mathematics  english
subodh         67       69           57       23
ram            90       32           59       43
abdul          87       45           33       56
john           56       43           90       76

In [43]:
marks_df['total']=marks_df['chemistry']+marks_df['physics']+marks_df['mathematics']+marks_df['english']
marks_df

        chemistry  physics  mathematics  english  total
subodh         67       69           57       23    216
ram            90       32           59       43    224
abdul          87       45           33       56    221
john           56       43           90       76    265

In [50]:
marks_df.loc[marks_df['english']==76].head()

      chemistry  mathematics  english  total
john         56           90       76    265

In [51]:
data_csv.loc[data_csv['area']==7420].head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished